package com.vita.sortedcollection;

public class MainChallenge {
    //here challenge.

    /*

    Изменить программу что бы добавленные компоненты в покупной корзине
    не изменяли количество конкретного количества, напротив, резервировало нужное количество компонентов(вещей)

    Нужно добавить "reserved" поле в StockItem class что бы хранить количество зарезервированых компонентов

    Компоненты могут добоалятся в корзину, ты н можешь зарезервировать больше чем доступно количество
    компонентов. (тебе нельзя забронировать больше чем доступно)

    Количество каждого компонентов меняется(уменьшается) когда корзина подверждается(checked out), в этот момент
    у всех зарегестрированных товаров в корзине уменьшеятся их действительный запас

    Когда checkout закончен, все содержимое корзины пропадает.

    Должен быть также способ "unreserve" компонентов добавленных в корзину по случайности

    Программа должна предотвратить любую возможность случайного "unreserve"

    Добавь код в Main который будет "unreserve" компоненты после того как они добавлены в покупную корзину,
    так же, "unreserving"(отмена) компонентов которые не были добавлены,  что бы проверить справится код или нет

    После проверки корзины, вывести на экран полную картину stocklist и
    контент каждой корзины который ты положил в нее.



     */

}
